WcfServices/federation/bookstore/result1/Iteration1/t1234798950_RequestBody.txt

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/03/addressing"><soap:Header><wsa:Action>http://tempuri.org/IBuyBook/BuyBook</wsa:Action><wsa:MessageID>uuid:abe59974-7df8-44a5-b32e-900b8f640991</wsa:MessageID><wsa:ReplyTo><wsa:Address>http://schemas.xmlsoap.org/ws/2004/03/addressing/role/anonymous</wsa:Address></wsa:ReplyTo><wsa:To>http://naveh05.emea.hpqcorp.net/FederationSample/BookStoreService/store.svc/buy</wsa:To></soap:Header><soap:Body><BuyBook xmlns="http://tempuri.org/"><emailAddress>abcde</emailAddress><shipAddress>abcde</shipAddress></BuyBook></soap:Body></soap:Envelope>