WcfServices/federation/bookstore/result1/Iteration1/t1234798491_RequestBody.txt

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/03/addressing"><soap:Header><wsa:Action>http://tempuri.org/IBrowseBooks/BrowseBooks</wsa:Action><wsa:MessageID>uuid:27be1613-a7d6-49fd-a962-9c23476d9f20</wsa:MessageID><wsa:ReplyTo><wsa:Address>http://schemas.xmlsoap.org/ws/2004/03/addressing/role/anonymous</wsa:Address></wsa:ReplyTo><wsa:To>http://naveh05.emea.hpqcorp.net/FederationSample/BookStoreService/store.svc/browse</wsa:To></soap:Header><soap:Body><BrowseBooks xmlns="http://tempuri.org/" /></soap:Body></soap:Envelope>